In [1]:
import pandas as pd

In [2]:
#딕셔너리 객체 생성
data_dic = {
	'year': [2025,2026, 2027],
	'sales': [100, 110, 2000]
}

data_dic

{'year': [2025, 2026, 2027], 'sales': [100, 110, 2000]}

In [3]:
# 딕셔너리를 이용해 데이터프레임 객체 생성
df1 = pd.DataFrame(data_dic)
df1

   year  sales
0  2025    100
1  2026    110
2  2027   2000

In [4]:
data2 = ['A', 'B', 'C', 'D', 'E']

df2 = pd.DataFrame([[89.2, 92.5, 90.8], [92.8, 89.9, 95.2]],
index = ['중간고사', '기말고사'], columns = data2[0:3])
df2

         A     B     C
중간고사  89.2  92.5  90.8
기말고사  92.8  89.9  95.2

In [6]:
data_df = [['20251101', 'Hong', '90', '95'], ['20251102',
'Kim', '93', '94'], ['20251103', 'Lee', '87', '97']]
df3 = pd.DataFrame(data_df)
df3

          0     1   2   3
0  20251101  Hong  90  95
1  20251102   Kim  93  94
2  20251103   Lee  87  97

In [7]:
df3.columns = ['학번', '이름', '중간고사', '기말고사']
df3

         학번    이름 중간고사 기말고사
0  20251101  Hong   90   95
1  20251102   Kim   93   94
2  20251103   Lee   87   97

In [8]:
df3.head(2)

         학번    이름 중간고사 기말고사
0  20251101  Hong   90   95
1  20251102   Kim   93   94

In [9]:
df3.tail(2)

         학번   이름 중간고사 기말고사
1  20251102  Kim   93   94
2  20251103  Lee   87   97

In [10]:
df3['이름']

0    Hong
1     Kim
2     Lee
Name: 이름, dtype: object

In [15]:
# 컬럼으로 열 삭제
df3.drop(columns='학번', inplace=True)
df3

     이름 중간고사 기말고사
0  Hong   90   95
1   Kim   93   94
2   Lee   87   97

In [16]:
# 인덱스로 행 삭제
df3.drop(0, inplace=True)
df3

    이름 중간고사 기말고사
1  Kim   93   94
2  Lee   87   97

In [17]:
# 두 DataFrame 병합하기
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'], 
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                   index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                   index=[4, 5, 6, 7])

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']},
                   index=[8, 9, 10, 11])

In [18]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [19]:
#두개의 데이터 프레임을 위, 아래로 합치기(열 방향)
#인덱스를 기준으로 합침
result = pd.concat([df1, df2, df3])
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [20]:
#key옵션 추가시 다중 인덱스를 부여 할 수 있음음
result = pd.concat([df1, df2, df3], keys=['x', 'y', 'z'])
result

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

In [21]:
result.index

MultiIndex([('x',  0),
            ('x',  1),
            ('x',  2),
            ('x',  3),
            ('y',  4),
            ('y',  5),
            ('y',  6),
            ('y',  7),
            ('z',  8),
            ('z',  9),
            ('z', 10),
            ('z', 11)],
           )

In [30]:
df4 = pd.DataFrame({'B': ['B2', 'B3', 'B6', 'B7'], 
                    'D': ['D2', 'D3', 'D6', 'D7'],
                    'F': ['F2', 'F3', 'F6', 'F7']},
                   index=[2, 3, 6, 7])

#axis = 1 옵션 추가 -> 열 방향으로 동작, 가로 방향으로 데이터를 합침
# 이때 인덱스를 기준으로 합친다.
#값을 가질 수 없는 곳은 NaN이 저장됨
result = pd.concat([df1, df4], axis=1)
result

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [ ]:
# join='inner'옵션 추가시 공통되지 않은 index의 데이터는 버린다.
result = pd.concat([df1, df4], axis=1, join='inner')

In [28]:
result

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

In [31]:
left = pd.DataFrame({'key': ['K0', 'K4', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})

right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                      'C': ['C0', 'C1', 'C2', 'C3'],
                      'D': ['D0', 'D1', 'D2', 'D3']})

In [32]:
#공통 컬럼 'key'를 기준으로 공통 key를 기준으로 합침(행 방향)
# 
pd.merge(left, right, on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3

In [35]:
# how 옵션으로 한쪽 데이터를 설정할 수 있음
pd.merge(left, right, how='left', on='key')

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K4  A1  B1  NaN  NaN
2  K2  A2  B2   C2   D2
3  K3  A3  B3   C3   D3

In [36]:
pd.merge(left, right, how='right', on='key')

  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K1  NaN  NaN  C1  D1
2  K2   A2   B2  C2  D2
3  K3   A3   B3  C3  D3

In [37]:
# 합집합처럼 병합됨
pd.merge(left, right, how='outer', on='key')

  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K1  NaN  NaN   C1   D1
2  K2   A2   B2   C2   D2
3  K3   A3   B3   C3   D3
4  K4   A1   B1  NaN  NaN

In [ ]:
# 교집합(공통된 요소만 가짐)
pd.merge(left, right, how='inner', on='key')